package student_eduard_minajev.lesson_8_inheritance.level_3_junior;

abstract class VehicleAbstract {

    public abstract void Vehicle ();

    /*
        Абстрактный класс - это скрытый класс, который сам не может создавать новые объекты, но может хранить методы. В каком-то плане это класс-шаблон или скелет/чек-лист,
        который может быть унаследован производными классами. Производные классы могут реализовать методы и создать объекты которые унаследовали из абстрактного класса.

     */

}
