package student_levs_blinnikovs.lesson_7_encapsulation.level_7_senior.task_15;

/*
Создать класс UserEntity с учетом, что вы уже знаете, что такое инкапсуляция.
У класса UserEntity должны быть поля:
  - id
  - имя
  - фамилия
  - персональный код

 */

class UserEntity {

    int id;              // final? Примечание: Пользователи должны быть уникальными по персональному кодуУ каждого пользователя есть уникальный идентификатор - id
    String firstName;
    String lastName;
    String personalCode;

    //создание пользователя
    //сохранение пользователя
    //получение пользователя по id
    //получение пользователей по имени
    //получение всех пользователей

    //редактирование пользователя
    //удаление пользователя

    //use TDD

}
