package student_ernest_aleskevics.lesson_1.homework.task_12;

public class Multiply {
    public static void main(String[] args) {
    /*
    Напишите Java программу, которая выведет на консоль результат умножения двух чисел.
    Числа можно придумать любые, их не надо запрашивать у пользователя.

    Тестовые данные:
    50 * 3
    Ожидаемый результат:
    150
    */

        int numberOne = 50;
        int numberTwo = 3;
        int result = numberOne * numberTwo;
        System.out.println(result);

    }



}
