package student_ernest_aleskevics.lesson_8.level_3.task_9;

public class AbstractClass {

    /* Абстрактный класс похож на обычный класс. В абстрактном классе также можно определить поля и методы,
       но в то же время нельзя создать объект или экземпляр абстрактного класса.
       Абстрактные классы призваны предоставлять базовый функционал для классов-наследников.
       А производные классы уже реализуют этот функционал.
       Нельзя создать объект или экземпляр абстрактного класса */

}
