package student_levs_blinnikovs.lesson_5_arrays_for_loop.level_3_junior.task_23;

// Найдите логическую ошибку в программе и исправить её:

class ForLoopDefinition7 {

    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println(i);

        }

    }

} // тут не хватало закрывающей скобки классе. Опять же это не логическая, а синтаксическая

