package student_yurii_panasiuk.lesson_8.level_2.task_5;

class Mother {

}

class Father {

}

class Child extends Mother {

}


/*
Механизм наследования позволяет наследовать класс только от одного суперкласса (единичное наследование).
В некоторых языках программирования, таких как C ++,
подкласс может наследоваться от нескольких суперклассов (множественное).

Так как множественный вариант может создать некоторые странные проблемы, например,
суперклассы содержат методы с одинаковыми именами и параметрами, он был исключен в Java.
Источник: https://java-blog.ru/osnovy/nasledovanie-java-s-primerami
 */