package student_levs_blinnikovs.lesson_5_arrays_for_loop.level_3_junior.task_22;

// Найдите логическую ошибку в программе и исправить её:

class ForLoopDefinition6 {

    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {               // не было открывающей скобки
            System.out.println(i);
        }
    }

}

