package student_ernest_aleskevics.lesson_1.homework;
/*
Напишите Java программу, которая выведет на консоль сумму двух чисел.
Числа можно придумать любые, их не надо запрашивать у пользователя.

Тестовые данные:
74 + 36
Ожидаемый результат:
110
*/

public class TotalSum {

    public static void main(String[] args) {
        int numberOne = 74;
        int numberTwo = 36;
        int result = numberOne + numberTwo;
        System.out.println(result);

    }



}

