package student_levs_blinnikovs.lesson_2_variables.level_7_senior.task_32;

/**
Напишите программу и продемонстрируйте в ней использование
однострочного и многострочного комментариев.
 */

/*
Напишите программу и продемонстрируйте в ней использование
однострочного и многострочного комментариев.
 */

//Напишите программу и продемонстрируйте в ней использование однострочного и многострочного комментариев.

public class Commentor {
    public static void main(String[] args) {
        System.out.println("See code above!");
    }
}
