package student_levs_blinnikovs.lesson_8_inheritance.level_3_junior.task_9;

import teacher.codereview.CodeReview;

@CodeReview(approved = true)
abstract class AbstractClass {

    /*
    Напишите ответы на вопросы тут.

    Что такое абстрактный класс?
    Абстрактный класс в объектно-ориентированном программировании — базовый класс,
    который не предполагает создания экземпляров.
    Абстрактный класс не может содержать какие-либо объекты,
    а также абстрактные конструкторы и абстрактные статические методы.
    Любой подкласс абстрактного класса должен либо реализовать все
    абстрактные методы суперкласса, либо сам быть объявлен абстрактным.


    Можно ли создать экземпляр абстрактного класса в момент выполнения программы?
    Нет.
*/

}
