package student_levs_blinnikovs.lesson_5_arrays_for_loop.level_3_junior.task_16;

//Найдите синтаксическую ошибку в программе и исправьте её:

class ForLoopDefinition1 {

    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {              // i не был инициализирован
            System.out.println(i);
        }
    }

}